maven-archetypes-jbi/maven-archetype-jbi-se/src/main/resources/archetype-resources/test/java/enginetest/Input.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:echo="http://www.sun.com/jbi/examples/sample-service/echo">       
    <soapenv:Body>
        <echo:item>
            <value>from httpsoap binding - hello new service engine!!!</value>
        </echo:item>
    </soapenv:Body>
</soapenv:Envelope>